tbs-bpm/tests/com.tibco.xpd.n2.test.feature/plugins/com.tibco.xpd.n2.mappings.validation.test/resources/XPD3773 JavaScript To XPath Conversion/XPD-3773/Service Descriptors/XPD3773-OperationWithExternalTopLevelElementSoapRequesy.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:subimpns="http://www.example.org/XPD-3773-SubImportedSchema">
	<SOAP-ENV:Body>
		<impns:ImportedTopLevelElement xmlns:impns="http://www.example.org/XPD-3773-ImportedSchema">
			<impns:impText>String</impns:impText>
			<subimpns:SubImportTopLevelElement>
				<subimpns:subImpText>String</subimpns:subImpText>
				<subimpns:subImpText2>String</subimpns:subImpText2>
			</subimpns:SubImportTopLevelElement>
			<impns:impElemWithSubImportType>
				<subimpns:subImpText>String</subimpns:subImpText>
				<subimpns:subImpText2>String</subimpns:subImpText2>
			</impns:impElemWithSubImportType>
		</impns:ImportedTopLevelElement>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

